tutorials/multiphase/waves/waveSolver/periodicSolitary/0/alpha1.org
/*---------------------------------------------------------------------------*\
 Caelus 7.04                                   
 Web:      www.caelus-cml.com 
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alpha1.org;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    cyclic1_half0
    {
        type            cyclic;
    }

    cyclic1_half1
    {
        type            cyclic;
    }

    bottom
    {
        type            slip;
    }

    atmosphere
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }

    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
