tutorials/multiphase/waves/waveSolver/periodicSolitary/constant/waveProperties.input
/*---------------------------------------------------------------------------*
Caelus 7.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      environmentalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

seaLevel	5.000;
seaLevelAsReference false;

relaxationNames ();

initializationName cyclic1;

cyclic1Coeffs
{
    waveType	solitaryFirst;
    height	2.0;
    depth       5;
    direction   (1 0 0);
    x0          (150 0 0);
};

// ************************************************************************* //
